USE веломагазин;
GO

-- Категории
INSERT INTO dbo.Category (Name) VALUES
(N'Велосипед взрослый горный'),
(N'Велосипед городской взрослый'),
(N'Велосипед городской подростковый'),
(N'Велосипед детский горный'),
(N'Велосипед детский городской');
GO

-- Производители
INSERT INTO dbo.Producer (Name) VALUES
(N'Aero'),
(N'Fizard'),
(N'NEXT'),
(N'Shimano'),
(N'Skill bike'),
(N'Slash'),
(N'kari');
GO

-- Поставщики
INSERT INTO dbo.Provider (Name) VALUES
(N'kari'),
(N'ВелоСтрана'),
(N'ПерспективаГрупп'),
(N'Скилс'),
(N'ЯндексМаркет');
GO

-- Единицы измерения
INSERT INTO dbo.Unit (Name) VALUES
(N'шт.');
GO

-- Роли
INSERT INTO dbo.Role (Name) VALUES
(N'Авторизированный клиент'),
(N'Администратор'),
(N'Менеджер');
GO

-- Статусы заказов
INSERT INTO dbo.OrderStatus (Name) VALUES
(N'Завершен'),
(N'Новый');
GO

-- Пункты выдачи
INSERT INTO dbo.PickUpPoint (PostCode, City, Street, Building) VALUES
(N'420151', N'Лесной', N'Вишневая', N'32'),
(N'125061', N'Лесной', N'Подгорная', N'8'),
(N'630370', N'Лесной', N'Шоссейная', N'24'),
(N'400562', N'Лесной', N'Зеленая', N'32'),
(N'614510', N'Лесной', N'Маяковского', N'47'),
(N'410542', N'Лесной', N'Светлая', N'46'),
(N'620839', N'Лесной', N'Цветочная', N'8'),
(N'443890', N'Лесной', N'Коммунистическая', N'1'),
(N'603379', N'Лесной', N'Спортивная', N'46'),
(N'603721', N'Лесной', N'Гоголя', N'41'),
(N'410172', N'Лесной', N'Северная', N'13'),
(N'614611', N'Лесной', N'Молодежная', N'50'),
(N'454311', N'Лесной', N'Новая', N'19'),
(N'660007', N'Лесной', N'Октябрьская', N'19'),
(N'603036', N'Лесной', N'Садовая', N'4'),
(N'394060', N'Лесной', N'Фрунзе', N'43'),
(N'410661', N'Лесной', N'Школьная', N'50'),
(N'625590', N'Лесной', N'Коммунистическая', N'20'),
(N'625683', N'Лесной', N'8 Марта', NULL),
(N'450983', N'Лесной', N'Комсомольская', N'26'),
(N'394782', N'Лесной', N'Чехова', N'3'),
(N'603002', N'Лесной', N'Дзержинского', N'28'),
(N'450558', N'Лесной', N'Набережная', N'30'),
(N'344288', N'Лесной', N'Чехова', N'1'),
(N'614164', N'Лесной', N'Степная', N'30'),
(N'394242', N'Лесной', N'Коммунистическая', N'43'),
(N'660540', N'Лесной', N'Солнечная', N'25'),
(N'125837', N'Лесной', N'Шоссейная', N'40'),
(N'125703', N'Лесной', N'Партизанская', N'49'),
(N'625283', N'Лесной', N'Победы', N'46'),
(N'614753', N'Лесной', N'Полевая', N'35'),
(N'426030', N'Лесной', N'Маяковского', N'44'),
(N'450375', N'Лесной', N'Клубная', N'44'),
(N'625560', N'Лесной', N'Некрасова', N'12'),
(N'630201', N'Лесной', N'Комсомольская', N'17'),
(N'190949', N'Лесной', N'Мичурина', N'26');
GO

-- Товары
INSERT INTO dbo.Product (Article, Name, UnitId, Price, ProviderId, ProducerId, CategoryId, Discount, AmountInStock, Description, Photo) VALUES
(N'А112Т4', N'Велосипед взрослый горный Slash Stream 27.5 колеса (2025) 17" Черный (162-172 см)', 1, 19775, 2, 6, 1, 30, 15, N'Горный велосипед Slash Stream 27.5 (2025) – легкий и надежный компаньон для поездок по пересеченной местности. Мощные шатуны интенсивно передают усилия мышц на вал каретки.', N'1.jpg'),
(N'G843H5', N'Велосипед взрослый горный Slash Stream 27.5 колеса (2025) 19" Синий (172-182 см)', 1, 19791, 2, 6, 1, 30, 9, N'В комплектацию включены дисковые механические тормоза RPT DSC-310. Особый упор разработчики рамы данной модели сделали на увеличение прочности мест наибольшей нагрузки.', N'2.jpg'),
(N'D325D4', N'Велосипед городской подростковый серый', 1, 9919, 5, 4, 3, 5, 12, N'Городской подростковый велосипед - идеальный выбор для активного образа жизни! Откройте для себя комфорт и свободу передвижения с нашим стильным городским велосипедом.', N'3.jpg'),
(N'S432T5', N'Велосипед Skill Bike 3051, городской, 21 скорость, сталь, 29" колеса, черно-красный', 1, 16442, 4, 5, 2, 15, 15, N'SKILL BIKE модель 3051 - горный велосипед на спицах, обеспечивающий уверенную и комфортную езду как по городским улицам, так и по горной местности.', N'4.jpg'),
(N'F325D4', N'Велосипед Skillbike 3052, горный, складной, рама 17 дюймов, колеса 26 дюймов, 21 скорость', 1, 17985, 4, 5, 1, 18, 50, N'SKILL BIKE модель 3052 - велосипед складной, предназначен для тех, кто ценит комфорт, стиль и максимальную мобильность. Горный велосипед легко помещается в багажник и идеально подходит для активных поездок в городской суете.', N'5.jpg'),
(N'G432G6', N'Велосипед Skill Bike 3053, горный, двухподвесный, рама 17 дюймов, колеса 26 дюймов, 21 скорость', 1, 17621, 4, 5, 1, 20, 0, N'SKILL BIKE модель 3053 - горный велосипед на литых дисках, имеет амортизаторы как на переднем, так и на заднем колесе.', N'6.jpg'),
(N'H542F5', N'Велосипед MILANO M300, горный, для взрослых, 26", 7 скоростей', 1, 13509, 3, 3, 1, 4, 5, N'Горный велосипед MILANO M300 с диаметром колес 26 дюйма подойдет для подростков и взрослых, без усилий позволит преодолевать любые непроходимые каменистые поверхности и зоны бездорожья.', N'7.jpg'),
(N'C346F5', N'Горный велосипед скоростной, колёса 24", рама - 14", черно-красный', 1, 15212, 3, 1, 4, 5, 4, N'Горный велосипед – это надежный и стильный выбор для любителей активного отдыха. Удобное седло из искусственной кожи и наличие подножки добавляют удобства во время поездок.', N'8.jpg'),
(N'F256G6', N'26" Велосипед Fizard, 15" алюминий, дисковые тормоза, 21 скорость, серый', 1, 15126, 3, 2, 4, 25, 3, N'Горный велосипед Fizard — надёжный универсальный маунтинбайк для города и бездорожья.', N'9.jpg'),
(N'J532V5', N'Велосипед двухколесный детский 14 дюймов, со светящимися колесами, черный', 1, 6417, 1, 7, 5, 8, 6, N'Велосипед двухколесный детский 14 дюймов от Kari - это надежный и безопасный транспорт для вашего ребенка.', NULL);
GO

-- Пользователи
INSERT INTO dbo.[User] (Surname, Name, Patronmic, Login, Password, RoleId) VALUES
(N'Никифорова', N'Весения',  N'Николаевна',   N'94d5ous@gmail.com',    N'uzWC67', 2),
(N'Сазонов',    N'Руслан',   N'Германович',    N'uth4iz@mail.com',      N'2L6KZG', 2),
(N'Одинцов',    N'Серафим',  N'Артёмович',     N'5d4zbu@tutanota.com',  N'rwVDh9', 2),
(N'Ситдикова',  N'Елена',    N'Анатольевна',   N'ptec8ym@yahoo.com',    N'LdNyos', 3),
(N'Ворсин',     N'Петр',     N'Евгеньевич',    N'1qz4kw@mail.com',      N'gynQMT', 3),
(N'Старикова',  N'Елена',    N'Павловна',      N'4np6se@mail.com',      N'AtnDjr', 3),
(N'Никифорова', N'Анна',     N'Семеновна',     N'yzls62@outlook.com',   N'JlFRCZ', 1),
(N'Стелина',    N'Евгения',  N'Петровна',      N'1diph5e@tutanota.com', N'8ntwUp', 1),
(N'Михайлюк',   N'Анна',     N'Вячеславовна',  N'tjde7c@yahoo.com',     N'YOyhfR', 1),
(N'Степанов',   N'Михаил',   N'Артёмович',     N'wpmrc3do@tutanota.com',N'RSbvHv', 1);
GO

-- Заказы
INSERT INTO dbo.[Order] (CreationDate, DeliveryDate, PickUpPointId, UserId, ReceiptCode, StatusId) VALUES
('2023-02-27', '2023-04-20',  1, 10, N'901', 2),
('2022-09-28', '2023-04-21', 11,  1, N'902', 2),
('2023-03-21', '2023-04-22',  2,  2, N'903', 2),
('2023-02-20', '2023-04-23', 11,  3, N'904', 1),
('2023-03-17', '2023-04-24',  2, 10, N'905', 1),
('2023-03-01', '2023-04-25', 15,  1, N'906', 1),
('2023-03-30', '2023-04-26',  3,  2, N'907', 1),
('2023-03-31', '2023-04-27', 19,  3, N'908', 2),
('2023-04-02', '2023-04-28',  5, 10, N'909', 2),
('2023-04-03', '2023-04-29', 19, 10, N'910', 2);
GO

-- Товары в заказах
INSERT INTO dbo.ProductInOrder (OrderId, ProductId, Amount) VALUES
(1,  1, 2),
(1,  2, 2),
(2,  2, 1),
(2,  1, 1),
(3,  3, 10),
(3,  4, 10),
(4,  5, 5),
(4,  3, 4),
(5,  6, 20),
(5,  7, 20),
(6,  1, 2),
(6,  2, 2),
(7,  8, 3),
(7,  9, 3),
(8,  5, 1),
(8,  6, 1),
(9, 10, 5),
(9,  9, 1),
(10, 9, 5),
(10,10, 5);
GO

PRINT 'Данные успешно импортированы!';
GO
